Tekla Open API Reference for Tekla Structures 2025
RebarLengthAdjustmentDataNullable.AdjustmentType Property
 Gets or sets the adjustment type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarLengthAdjustmentDataNullable.LengthAdjustmentTypeEnum? AdjustmentType { get; set; }
Public Property AdjustmentType As RebarLengthAdjustmentDataNullable.LengthAdjustmentTypeEnum?
	Get
	Set
Property Value
Type: Nullable<RebarLengthAdjustmentDataNullable.LengthAdjustmentTypeEnum>
See Also
Reference
RebarLengthAdjustmentDataNullable Class
Tekla.Structures.Model Namespace